src/cf/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПредложениеПоставщика</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>ЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ПрисоединённыеФайлы/ПрисоединённыеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрисоединённыеФайлы</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Внешний</name>
    <comment>Признак хранения файла на диске</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладельцыПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Связь</name>
    <comment>Связь со внутренним реквизитом объекта</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор файла, так же служит для связи c файлом на диске</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/НазначенияРассылок/НазначенияРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияРассылок</name>
  <enumValues>
    <name>Руководство</name>
  </enumValues>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>ОтделЗакупок</name>
  </enumValues>
  <enumValues>
    <name>ОтделПродаж</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ЗаказПоставщику/ManagerModule.bsl
#Область Печать

Процедура ПечатьЗаказПоставщику(Док, Таб) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ЗаказПоставщику_ЗаказПоставщику";	
	Макет = Документы.ЗаказПоставщику.ПолучитьМакет("ЗаказПоставщику");
	
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	
	оЗаголовок.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док);
	оЗаголовок.Параметры.ПредставлениеПоставщика = КарточкаКонтрагента.Представление;
	оЗаголовок.Параметры.ПредставлениеПокупателя = КарточкаОрганизации.Представление;
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		оЗаголовок.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	Таб.Вывести(оЗаголовок);
	оШапка.Параметры.Заполнить(Док);
	Таб.Вывести(оШапка);
	
	ТЗТовары = ВыводПечатныхФорм.СформироватьТабличныеДанные(Док.ТЧТовары.Выгрузить());	
	Для Каждого Стр Из ТЗТовары Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.CodeFournisseur = Стр.Номенклатура.КодПоставщика;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оПодвал.Параметры.Комментарий = Док.Комментарий;
	оПодвал.Параметры.Ответственный = Док.Ответственный;
	Таб.Вывести(оПодвал);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Commande fournisseur");
КонецПроцедуры

Процедура ПечатьЗапросКотировок(Док, Таб, СФото = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.Автомасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ЗаказПоставщику_ЗапросКотировок";	
	Макет = Документы.ЗаказПоставщику.ПолучитьМакет("ЗапросКотировок");
	
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата);
	КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Если СФото Тогда 
		оШапка = Макет.ПолучитьОбласть("ШапкаФото");
		оСтрока = Макет.ПолучитьОбласть("СтрокаФото");
	Иначе
		оШапка = Макет.ПолучитьОбласть("Шапка");
		оСтрока = Макет.ПолучитьОбласть("Строка");
	КонецЕсли;
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	
	оЗаголовок.Параметры.ТекстЗаголовка = НСтр("fr = 'Demande devis'; ru = 'Запрос котировок'; en = 'Request for quotations'; es = 'Solicitar cotizaciones'");
	оЗаголовок.Параметры.ПредставлениеПоставщика = КарточкаКонтрагента.Представление;
	оЗаголовок.Параметры.ПредставлениеПокупателя = КарточкаОрганизации.Представление;
	FieldPhoto = Док.Организация.Логотип.Get();
	Try
		оЗаголовок.Drawings[0].Picture = New Picture(FieldPhoto);
	Except
	EndTry;
	Таб.Вывести(оЗаголовок);
	оШапка.Параметры.Заполнить(Док);
	Таб.Вывести(оШапка);
	
	ТЗТовары = ВыводПечатныхФорм.СформироватьТабличныеДанные(Док.ТЧТовары.Выгрузить());	
	Для Каждого Стр Из ТЗТовары Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.CodeFournisseur = Стр.Номенклатура.КодПоставщика;
		оСтрока.Параметры.CodeFabricant = Стр.Номенклатура.КодПроизводителя;
		оСтрока.Параметры.ID = Стр.НоменклатураАртикул;
		Если СФото Тогда 
			НЗ = РегистрыСведений.ПрисоединённыеФайлы.СоздатьНаборЗаписей();
			НЗ.Отбор.Объект.Установить(Стр.Номенклатура);
			НЗ.Прочитать();
			Если НЗ.Количество() = 0 Тогда
				Картинка = Новый Картинка;
			Иначе
				ПерваяЗапись = НЗ.Получить(0);
				Если ПерваяЗапись.Внешний Тогда 
					Картинка = Новый Картинка(ПерваяЗапись.ИмяФайла);
				Иначе 
					Картинка = Новый Картинка(ПерваяЗапись.Данные.Получить());
				КонецЕсли;
			КонецЕсли;
			оСтрока.Рисунки.Получить(0).Картинка = Картинка;
		КонецЕсли;
		Таб.Вывести(оСтрока);
	КонецЦикла;
	оПодвал.Параметры.Комментарий = Док.Комментарий;
	оПодвал.Параметры.Ответственный = Док.Ответственный;
	Таб.Вывести(оПодвал);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, "Заказ поставщику");
КонецПроцедуры

#КонецОбласти

#Область EMail

Процедура ОтправитьЗаказыПоставщикуКонтрагентам(МасДокументы) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	УчётнаяЗапись = Справочники.УчётныеЗаписиЭлектроннойПочты.ПолучитьПоФизическомуЛицу(ПараметрыСеанса.ФизическоеЛицо);
	Если Не ЗначениеЗаполнено(УчётнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("fr = 'Aucun compte de messagerie sélectionné'; ru = 'Не выбрана учётная запись рассылки сообщений'; en = 'The message distribution account is not selected'; es = 'No se ha seleccionado la cuenta de envío de mensajes'"));
		Возврат;
	КонецЕсли;
	ТипКО = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail;
	НазначениеРассылки = Перечисления.НазначенияРассылок.ОтделПродаж;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказПоставщику.Ссылка КАК Ссылка,
	                      |	ЗаказПоставщику.Дата КАК Дата,
	                      |	ЗаказПоставщику.Номер КАК Номер,
	                      |	ЗаказПоставщику.Контрагент КАК Контрагент,
	                      |	ЗаказПоставщику.Организация КАК Организация
	                      |ИЗ
	                      |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                      |ГДЕ
	                      |	ЗаказПоставщику.Ссылка В(&Док)");
	Запрос.УстановитьПараметр("Док", МасДокументы);
	ТЗДокументы = Запрос.Выполнить().Выгрузить();
	ТЗКонтактнаяИнформация = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьКонтактнуюИнформацию(ТЗДокументы.ВыгрузитьКолонку("Контрагент"), ТипКО, НазначениеРассылки);	
	Для Каждого Стр Из ТЗДокументы Цикл		 
		// Адресаты
		МасАдреса = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьКонтактнуюИнформациюПоТипу(Стр.Контрагент, ТипКО, НазначениеРассылки, ТЗКонтактнаяИнформация);
		Если МасАдреса.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не заполнены адреса по документу - '; fr = 'Adresses non renseignées sur le document -'") + СокрЛП(Стр.Ссылка));
			Возврат;
		КонецЕсли;
		// Формируем
		МасВложения = Новый Массив;
		Каталог = КаталогВременныхФайлов();
		ТемаПисьма = СокрЛП(Стр.Организация) +  " - Заказ поставщику №" + Стр.Номер + " от " + Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
		Таб = Новый ТабличныйДокумент;
		Документы.ЗаказПоставщику.ПечатьЗаказПоставщику(Стр.Ссылка, Таб); 
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ОбработатьИмяФайла(СокрЛП(Стр.Ссылка) + ".pdf");
		АдресВложения = Каталог + ИмяФайла;
		Таб.Записать(АдресВложения, ТипФайлаТабличногоДокумента.PDF);
		МасВложения.Добавить(АдресВложения);
		// Отправляем 		
		Результат = РаботаСЭлектроннойПочтой.ОтправитьСообщение(УчётнаяЗапись, МасАдреса, ТемаПисьма, "", МасВложения);
		Сообщить(Результат.Описание);
		// Удаляем временные файлы
		Для Каждого Вложение Из МасВложения Цикл
			УдалитьФайлы(Вложение);
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти
